{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. // OFF
. // ==========================================================================
. // ON
. 
. /***
> # Lab 11
>   - SOC 5050: Quantitative Analysis
>   - 05 Nov 2016
>   - CHRIS
> 
> ### Part 1 - One-Sample T-Test
> ***/
. 
. ttest socst==54

{txt}One-sample t test
{hline 9}{c TT}{hline 68}
Variable{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
   socst {c |}{res}{col 12}    200{col 22}   52.405{col 34} .7591352{col 46} 10.73579{col 58} 50.90802{col 70} 53.90198
{txt}{hline 9}{c BT}{hline 68}
    mean = mean({res}socst{txt})                                            t = {res} -2.1011
{txt}Ho: mean = {res}54                                    {txt}degrees of freedom = {res}     199

    {txt}Ha: mean < {res}54               {txt}Ha: mean != {res}54                 {txt}Ha: mean > {res}54
 {txt}Pr(T < t) = {res}0.0184         {txt}Pr(|T| > |t|) = {res}0.0369          {txt}Pr(T > t) = {res}0.9816
{txt}
{com}. 
. //OFF
. // set local macros
. local t = round(r(t),.001)
{txt}
{com}. local p = round(r(p),.001)
{txt}
{com}. 
. // collapse dataset
. collapse (mean) mean = socst (sd) sd = socst (count) n = socst
{txt}
{com}. 
. // caclulate stnadard error
. generate se = sd/sqrt(n)
{txt}
{com}. 
. // create categorical indicator
. generate cat = 1
{txt}
{com}. 
. // generate plot
. serrbar mean se cat, scale(1.96) ///
>         yline(54, lcolor(red)) yscale(r(49.9 55.1)) ///
>         ylabel(50(1)55, grid) ytitle("Mean Social Studies Score") ///
>         xlabel(none) xtitle("") ///
>         scheme(s2mono) ///
>         graphregion(color("235 235 235")) ///
>         plotregion(color("255 255 255")) ///
>         bgcolor("235 235 235") ///
>   title("One Sample T-Test: Social Studies Score and {c -(}&mu{c )-}=54") ///
>         text(54.1 1 "{c -(}&mu{c )-}", place(n)) ///
>   note("Results: {c -(}it:t{c )-} = `t', {c -(}it:p{c )-} = `p'") ///
>         caption("Produced by Christopher Prener, Ph.D.; Data via UCLA ATS")
{res}{txt}
{com}. 
. // explort plot
. graph export "$projName/Plots/fig1.png", ///
>   as(png) width(1000) height(750) replace
{txt}(file Lab-10-Replication/Plots/fig1.png written in PNG format)

{com}. 
. // reopen data
. use "$projName/$newData", clear
{txt}(highschool and beyond (200 cases))

{com}. 
. //ON
. 
. /***
> ![fig1](https://raw.githubusercontent.com/slu-soc5050/Week-10/master/Lab/Lab-10-Replication/Plots/fig1.png)
> ***/
. 
. txt "**1.** The results of the one-sample t-test (t = " `t' "; p = " ///
>   `p' ") indicate that these data are not drawn from where " ///
>   "the average score is 54."


{txt}> **1.** The results of the one-sample t-test (t = -2.101 ; p = .037 ) indicate that these data are not drawn from where the average score is 54.
{com}. 
. ttest science==54

{txt}One-sample t test
{hline 9}{c TT}{hline 68}
Variable{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
 science {c |}{res}{col 12}    200{col 22}    51.85{col 34} .7000987{col 46} 9.900891{col 58} 50.46944{col 70} 53.23056
{txt}{hline 9}{c BT}{hline 68}
    mean = mean({res}science{txt})                                          t = {res} -3.0710
{txt}Ho: mean = {res}54                                    {txt}degrees of freedom = {res}     199

    {txt}Ha: mean < {res}54               {txt}Ha: mean != {res}54                 {txt}Ha: mean > {res}54
 {txt}Pr(T < t) = {res}0.0012         {txt}Pr(|T| > |t|) = {res}0.0024          {txt}Pr(T > t) = {res}0.9988
{txt}
{com}. 
. //OFF
. // set local macros for key values
. local t = round(r(t),.001)
{txt}
{com}. local p = round(r(p),.001)
{txt}
{com}. 
. // collapse dataset
. collapse (mean) mean = science (sd) sd = science (count) n = science
{txt}
{com}. 
. // caclulate stnadard error
. generate se = sd/sqrt(n)
{txt}
{com}. 
. // create categorical indicator
. generate cat = 1
{txt}
{com}. 
. // generate plot
. serrbar mean se cat, scale(1.96) ///
>         yline(54, lcolor(red)) yscale(r(49.9 55.1)) ///
>         ylabel(50(1)55, grid) ytitle("Mean Science Score") ///
>         xlabel(none) xtitle("") ///
>         scheme(s2mono) ///
>         graphregion(color("235 235 235")) ///
>         plotregion(color("255 255 255")) ///
>         bgcolor("235 235 235") ///
> title("One Sample T-Test: Science Score and {c -(}&mu{c )-}=54") ///
>         text(54.1 1 "{c -(}&mu{c )-}", place(n)) ///
>   note("Results: {c -(}it:t{c )-} = `t', {c -(}it:p{c )-} = `p'") ///
>         caption("Produced by Christopher Prener, Ph.D.; Data via UCLA ATS")
{res}{txt}
{com}. 
. // export plot
. graph export "$projName/Plots/fig2.png", ///
>   as(png) width(1000) height(750) replace
{txt}(file Lab-10-Replication/Plots/fig2.png written in PNG format)

{com}. 
. // reopen dataset
. use "$projName/$newData", clear
{txt}(highschool and beyond (200 cases))

{com}. 
. //ON
. 
. /***
> ![fig2](https://raw.githubusercontent.com/slu-soc5050/Week-10/master/Lab/Lab-10-Replication/Plots/fig2.png)
> ***/
. 
. txt "**2.** Like question **1**, the results of the one-sample " ///
>   "t-test (t = " `t' "; p = " `p' ") indicate that these " ///
>   "data are not drawn from where the average score is 54."


{txt}> **2.** Like question **1**, the results of the one-sample t-test (t = -3.071 ; p = .002 ) indicate that these data are not drawn from where the average score is 54.
{com}. 
. /***
> ### Part 2 - Independent T-Test
> ***/
. 
. sdtest science, by(female)

{txt}Variance ratio test
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
    male {c |}{res}{col 12}     91{col 22} 53.23077{col 34} 1.125037{col 46} 10.73217{col 58} 50.99569{col 70} 55.46585
  {txt}female {c |}{res}{col 12}    109{col 22} 50.69725{col 34} .8657315{col 46} 9.038503{col 58} 48.98122{col 70} 52.41328
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}    200{col 22}    51.85{col 34} .7000987{col 46} 9.900891{col 58} 50.46944{col 70} 53.23056
{txt}{hline 9}{c BT}{hline 68}
    ratio = sd({res}male{txt}) / sd({res}female{txt})                                 f = {res}  1.4099
{txt}Ho: ratio = 1                                    degrees of freedom =  {res}90, 108

    {txt}Ha: ratio < 1               Ha: ratio != 1                 Ha: ratio > 1
  Pr(F < f) = {res}0.9562         {txt}2*Pr(F > f) = {res}0.0876        {txt}   Pr(F > f) = {res}0.0438
{txt}
{com}. 
. txt "**3.** The results of the Levene's test (f = " %10.3f r(F) "; p = " ///
>   %10.3f r(p) ") indicate that the assumption of homogenetiy of variance" ///
>   " holds for these data. The variance of science scores for men is " ///
>   "not significantly different from the variance of science scores for women."


{txt}> **3.** The results of the Levene's test (f = 1.410; p = 0.088) indicate that the assumption of homogenetiy of variance holds for these data. The variance of science scores for men is not significantly different from the variance of science scores for women.
{com}. 
. ttest science, by(female)

{txt}Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
    male {c |}{res}{col 12}     91{col 22} 53.23077{col 34} 1.125037{col 46} 10.73217{col 58} 50.99569{col 70} 55.46585
  {txt}female {c |}{res}{col 12}    109{col 22} 50.69725{col 34} .8657315{col 46} 9.038503{col 58} 48.98122{col 70} 52.41328
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}    200{col 22}    51.85{col 34} .7000987{col 46} 9.900891{col 58} 50.46944{col 70} 53.23056
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22} 2.533522{col 34} 1.397901{col 58} -.223164{col 70} 5.290207
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}male{txt}) - mean({res}female{txt})                              t = {res}  1.8124
{txt}Ho: diff = 0                                     degrees of freedom = {res}     198

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.9643         {txt}Pr(|T| > |t|) = {res}0.0714          {txt}Pr(T > t) = {res}0.0357
{txt}
{com}. 
. //OFF
. 
. // store value of t
. local t = round(r(t),.001)
{txt}
{com}. 
. // store value of p
. local p = round(r(p),.0001)
{txt}
{com}. 
. //ON
. 
. esize twosample science, by(female) cohensd

{txt}Effect size based on mean comparison

                               Obs per group:
                                        male =         91
                                      female =        109
{col 1}{text}{hline 20}{c TT}{hline 12}{hline 12}{hline 12}
{col 1}{text}        Effect Size{col 21}{c |}   Estimate{col 34}    [95% Conf. Interval]
{col 1}{text}{hline 20}{c +}{hline 12}{hline 12}{hline 12}
{col 1}{text}          Cohen's {it:d}{col 21}{c |}{result}{space 2}  .257353{col 34}{space 3}-.0224299{col 46}{space 3} .5364914
{col 1}{text}{hline 20}{c BT}{hline 12}{hline 12}{hline 12}

{com}. 
. //OFF
. // store value of d
. local d = round(r(d),.001)
{txt}
{com}. 
. // collapse dataset
. collapse (mean) mean = science (sd) sd = science (count) n = science, by(female)
{txt}
{com}. 
. // calculate standard error
. generate se = sd/sqrt(n)
{txt}
{com}. 
. // generate plot
. serrbar mean se female, scale(1.96)  ///
>         ytitle("Mean Science Scores") ///
>         xscale(r(-.2 1.2)) ///
>         xlabel(0 "male" 1 "female") xtitle("Gender") ///
>         scheme(s2mono) ///
>         graphregion(color("235 235 235")) ///
>         plotregion(color("255 255 255")) ///
>         bgcolor("235 235 235") ///
>         title("Two Sample T-Test: Science Scores by Gender") ///
>         note("Results: {c -(}it:t{c )-} = `t', {c -(}it:p{c )-} = `p', Cohen's {c -(}it:d{c )-} = `d'") ///
>         caption("Produced by Christopher Prener, Ph.D.; Data via UCLA ATS")
{res}{txt}
{com}. 
. // export plot
. graph export "$projName/Plots/fig3.png", ///
>   as(png) width(1000) height(750) replace
{txt}(file Lab-10-Replication/Plots/fig3.png written in PNG format)

{com}. 
. // reopen dataset
. use "$projName/$newData", clear
{txt}(highschool and beyond (200 cases))

{com}. //ON
. 
. /***
> ![fig3](https://raw.githubusercontent.com/slu-soc5050/Week-10/master/Lab/Lab-10-Replication/Plots/fig3.png)
> ***/
. 
. txt "**5.** The results of the independent t-test (t = " `t' "; p = " ///
>   `p' "; d = " `d' ") indicate that there is not a substantive difference" ///
>   " in mean science scores between males and females in this sample."


{txt}> **5.** The results of the independent t-test (t = 1.812 ; p = .0714 ; d = .257 ) indicate that there is not a substantive difference in mean science scores between males and females in this sample.
{com}. 
. txt "**6.** The results of the Cohen's d test (d = " `d' ") are " ///
>   "consistent with there not being a substantive difference in mean " ///
>   "science scores by gender - the reported effect size is small."


{txt}> **6.** The results of the Cohen's d test (d = .257 ) are consistent with there not being a substantive difference in mean science scores by gender - the reported effect size is small.
{com}. 
. /***
> ### Part 3 - Dependent T-test
> ***/
. 
. ttest write==socst

{txt}Paired t test
{hline 9}{c TT}{hline 68}
Variable{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
   write {c |}{res}{col 12}    200{col 22}   52.775{col 34} .6702372{col 46} 9.478586{col 58} 51.45332{col 70} 54.09668
   {txt}socst {c |}{res}{col 12}    200{col 22}   52.405{col 34} .7591352{col 46} 10.73579{col 58} 50.90802{col 70} 53.90198
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 12}    200{col 22}      .37{col 34} .6403638{col 46} 9.056112{col 58}-.8927696{col 70}  1.63277
{txt}{hline 9}{c BT}{hline 68}
     mean(diff) = mean({res}write{txt} - {res}socst{txt})                             t = {res}  0.5778
{txt} Ho: mean(diff) = 0                              degrees of freedom = {res}     199

 {txt}Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = {res}0.7180         {txt}Pr(|T| > |t|) = {res}0.5641          {txt}Pr(T > t) = {res}0.2820
{txt}
{com}. 
. //OFF
. 
. // store value of t
. local t = round(r(t),.001)
{txt}
{com}. 
. // store value of p
. local p : display %-10.3f r(p)
{res}{txt}
{com}. 
. // store mean, standard deviation, and n for read
. local mean1 = r(mu_1)
{txt}
{com}. local sd1 = r(sd_1)
{txt}
{com}. local n1 = r(N_1)
{txt}
{com}. 
. // store mean, standard deviation, and n for write
. local mean2 = r(mu_2)
{txt}
{com}. local sd2 = r(sd_2)
{txt}
{com}. local n2 = r(N_2)
{txt}
{com}. 
. // clear loaded dataset
. clear
{txt}
{com}. 
. // create simple dataset for summary data
. set obs 2
{txt}{p}
number of observations (_N)  was 0,
now 2
{p_end}

{com}. 
. // create variables
. generate cat = .
{txt}(2 missing values generated)

{com}. generate mean = .
{txt}(2 missing values generated)

{com}. generate sd = .
{txt}(2 missing values generated)

{com}. generate n = .
{txt}(2 missing values generated)

{com}. 
. // add summary data for write
. replace cat = 0 in 1
{txt}(1 real change made)

{com}. replace mean = `mean1' in 1
{txt}(1 real change made)

{com}. replace sd = `sd1' in 1
{txt}(1 real change made)

{com}. replace n = `n1' in 1
{txt}(1 real change made)

{com}. 
. // add summary data for social science
. replace cat = 1 in 2
{txt}(1 real change made)

{com}. replace mean = `mean2' in 2
{txt}(1 real change made)

{com}. replace sd = `sd2' in 2
{txt}(1 real change made)

{com}. replace n = `n2' in 2
{txt}(1 real change made)

{com}. 
. // calculate standard error
. generate se = sd/sqrt(n)
{txt}
{com}. 
. // generate plot
. serrbar mean se cat, scale(1.96) ///
>   yscale(r(49.9 55.1)) ///
>   ylabel(50(1)55, grid) ytitle("Mean Scores") ///
>         xscale(r(-.2 1.2)) ///
>         xlabel(0 "writing" 1 "social science") xtitle("Score Type") ///
>         scheme(s2mono) ///
>         graphregion(color("235 235 235")) ///
>         plotregion(color("255 255 255")) ///
>         bgcolor("235 235 235") ///
>         title("Dependent Sample T-Test:") ///
>   subtitle("Writing and Social Science Scores") ///
>         note("Results: {c -(}it:t{c )-} = `t', {c -(}it:p{c )-} = `p'") ///
>         caption("Produced by Christopher Prener, Ph.D.; Data via UCLA ATS")
{res}{txt}
{com}. 
. // export plot
. graph export "$projName/Plots/fig4.png", ///
>   as(png) width(1000) height(750) replace
{txt}(file Lab-10-Replication/Plots/fig4.png written in PNG format)

{com}. 
. // clear dataset
. clear
{txt}
{com}. 
. //ON
. 
. /***
> ![fig4](https://raw.githubusercontent.com/slu-soc5050/Week-10/master/Lab/Lab-10-Replication/Plots/fig4.png)
> ***/
. 
. txt "**8.** The results of the dependent t-test (t = " `t' "; p = " ///
>   `p' "; d = " `d' ") indicate that there is not a substantive difference" ///
>   " between mean writing and social science scores in this sample."


{txt}> **8.** The results of the dependent t-test (t = .578 ; p = 0.564      ; d = .257 ) indicate that there is not a substantive difference between mean writing and social science scores in this sample.
{com}. 
. /***
> ### Part 4 - Power Analyses
> ***/
. 
. local effectSize = 9.900891*.2
{txt}
{com}. local lowerMean = 53-`effectSize'
{txt}
{com}. 
. power twomeans 53 `lowerMean', sd(9.900891) power(0.8)
{res}
{txt}Performing iteration ...
{res}
{p 0 2 2}{txt}Estimated sample sizes for a two-sample means test{p_end}{txt}t test assuming sd1 = sd2 = sd
{txt}{txt}{bind:Ho: m2 = m1}  {txt}versus  {bind:Ha: m2 != m1}

{txt}Study parameters:

{txt}{ralign 16:alpha = }{res}   0.0500
{txt}{ralign 16:power = }{res}   0.8000
{txt}{ralign 16:delta = }{res}  -1.9802
{txt}{ralign 16:m1 = }{res}  53.0000
{txt}{ralign 16:m2 = }{res}  51.0198
{txt}{ralign 16:sd = }{res}   9.9009

{p}{txt}Estimated sample sizes:{p_end}

{txt}{ralign 16:N = }{res}      788
{txt}{ralign 16:N per group = }{res}      394
{txt}
{com}. 
. txt "**10.** We use the output above in question **5**, we estimate " ///
>   "a mean science score for men as 53, for women as " ///
>   %10.3f `lowerMean' ", with a standard deviation of " %10.3f r(sd) ", " ///
>   "as pilot data to construct the power analysis. To detect a " ///
>   "small effect size with a power of 0.8, a sample size of " ///
>   r(N) " would be required with a minimum of " r(N1) " in each group."


{txt}> **10.** We use the output above in question **5**, we estimate a mean science score for men as 53, for women as 51.020, with a standard deviation of 9.901as pilot data to construct the power analysis. To detect a small effect size with a power of 0.8, a sample size of 788 would be required with a minimum of 394 in each group.
{com}. 
. local effectSize = 9.900891*.5
{txt}
{com}. local lowerMean = 53-`effectSize'
{txt}
{com}. 
. power twomeans 53 `lowerMean', sd(9.900891) power(0.9)
{res}
{txt}Performing iteration ...
{res}
{p 0 2 2}{txt}Estimated sample sizes for a two-sample means test{p_end}{txt}t test assuming sd1 = sd2 = sd
{txt}{txt}{bind:Ho: m2 = m1}  {txt}versus  {bind:Ha: m2 != m1}

{txt}Study parameters:

{txt}{ralign 16:alpha = }{res}   0.0500
{txt}{ralign 16:power = }{res}   0.9000
{txt}{ralign 16:delta = }{res}  -4.9504
{txt}{ralign 16:m1 = }{res}  53.0000
{txt}{ralign 16:m2 = }{res}  48.0496
{txt}{ralign 16:sd = }{res}   9.9009

{p}{txt}Estimated sample sizes:{p_end}

{txt}{ralign 16:N = }{res}      172
{txt}{ralign 16:N per group = }{res}       86
{txt}
{com}. 
. txt "**11.** Based on the output above in question **5**, we estimate " ///
>   "a mean science score for men as 53, for women as " ///
>   %10.3f `lowerMean' ", with a standard deviation of " %10.3f r(sd) ", " ///
>   "as pilot data to construct the power analysis. To detect a " ///
>   "moderate effect size with a power of 0.9, a sample size of " ///
>   r(N) " would be required with a minimum of " r(N1) " in each group."


{txt}> **11.** Based on the output above in question **5**, we estimate a mean science score for men as 53, for women as 48.050, with a standard deviation of 9.901as pilot data to construct the power analysis. To detect a moderate effect size with a power of 0.9, a sample size of 172 would be required with a minimum of 86 in each group.
{com}. 
. local effectSize = 9.900891*.8
{txt}
{com}. local lowerMean = 53-`effectSize'
{txt}
{com}. 
. power twomeans 53 `lowerMean', sd(9.900891) power(0.9)
{res}
{txt}Performing iteration ...
{res}
{p 0 2 2}{txt}Estimated sample sizes for a two-sample means test{p_end}{txt}t test assuming sd1 = sd2 = sd
{txt}{txt}{bind:Ho: m2 = m1}  {txt}versus  {bind:Ha: m2 != m1}

{txt}Study parameters:

{txt}{ralign 16:alpha = }{res}   0.0500
{txt}{ralign 16:power = }{res}   0.9000
{txt}{ralign 16:delta = }{res}  -7.9207
{txt}{ralign 16:m1 = }{res}  53.0000
{txt}{ralign 16:m2 = }{res}  45.0793
{txt}{ralign 16:sd = }{res}   9.9009

{p}{txt}Estimated sample sizes:{p_end}

{txt}{ralign 16:N = }{res}       68
{txt}{ralign 16:N per group = }{res}       34
{txt}
{com}. 
. txt "**12.** Based on the output above in question **5**, we estimate " ///
>   "a mean science score for men as 53, for women as " ///
>   %10.3f `lowerMean' ", with a standard deviation of " %10.3f r(sd) ", " ///
>   "as pilot data to construct the power analysis. To detect a " ///
>   "large effect size with a power of 0.8, a sample size of " ///
>   r(N) " would be required with a minimum of " r(N1) " in each group."


{txt}> **12.** Based on the output above in question **5**, we estimate a mean science score for men as 53, for women as 45.079, with a standard deviation of 9.901as pilot data to construct the power analysis. To detect a large effect size with a power of 0.8, a sample size of 68 would be required with a minimum of 34 in each group.
{com}. 
. // OFF
. // ==========================================================================
. 
. // end MarkDoc log
. quietly log close markdoc
{smcl}
{com}{sf}{ul off}